config.org
#+TITLE: Mi configuración de Doom Emacs (literate)
#+PROPERTY: header-args:emacs-lisp :tangle config.el :comments no :results none

Configuración de Doom organizada en secciones. Es un documento
/literate/: edito este =.org= (prosa + bloques de Elisp) y Doom ensambla
el =config.el= real al hacer =doom sync=.

La primera línea fija el /lexical binding/ (importante para closures):

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

* CONFIGURACIÓN BÁSICA

#+begin_src emacs-lisp

(setq user-full-name "Pascual M.G."
      user-mail-address "info@pascualmg.dev")

;; Silenciar warning de PGTK en X11 (funciona bien, solo avisa)
(setq warning-minimum-level :emergency)
#+end_src

* SISTEMA Y PATHS (Nix Integration)

#+begin_src emacs-lisp

;; Configuración de PATH para Nix
(defun setup-nix-paths ()
  "Configura los paths necesarios para integración con Nix."
  (let ((nix-paths (list
                    (concat (getenv "HOME") "/.nix-profile/bin")
                    "/run/current-system/sw/bin")))
    ;; Actualizar PATH del sistema
    (setenv "PATH" (concat (string-join nix-paths ":") ":" (getenv "PATH")))
    ;; Actualizar exec-path de Emacs
    (setq exec-path (append nix-paths exec-path))))

(setup-nix-paths)

;; Función auxiliar para verificar comandos esenciales
(defun verify-essential-commands ()
  "Verifica la disponibilidad de comandos esenciales."
  (interactive)
  (let ((commands '("gzip" "git" "ripgrep" "fd" "php" "composer" "stack")))
    (dolist (cmd commands)
      (message "%s: %s" cmd
               (if (executable-find cmd)
                   (propertize "✓ FOUND" 'face 'success)
                 (propertize "✗ NOT FOUND" 'face 'error))))))
#+end_src

