config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;;; Commentary:
;; Configuración personal de Doom Emacs
;; Organizada en secciones lógicas para mejor mantenimiento

;;; Code:

;; ════════════════════════════════════════════════════════════════════════════
;; CONFIGURACIÓN BÁSICA
;; ════════════════════════════════════════════════════════════════════════════

(setq user-full-name "Pascual M.G."
      user-mail-address "info@pascualmg.dev")

;; Silenciar warning de PGTK en X11 (funciona bien, solo avisa)
(setq warning-minimum-level :emergency)

;; ════════════════════════════════════════════════════════════════════════════
;; SISTEMA Y PATHS (Nix Integration)
;; ════════════════════════════════════════════════════════════════════════════

;; Configuración de PATH para Nix
(defun setup-nix-paths ()
  "Configura los paths necesarios para integración con Nix."
  (let ((nix-paths (list
                    (concat (getenv "HOME") "/.nix-profile/bin")
                    "/run/current-system/sw/bin")))
    ;; Actualizar PATH del sistema
    (setenv "PATH" (concat (string-join nix-paths ":") ":" (getenv "PATH")))
    ;; Actualizar exec-path de Emacs
    (setq exec-path (append nix-paths exec-path))))

(setup-nix-paths)

;; Función auxiliar para verificar comandos esenciales
(defun verify-essential-commands ()
  "Verifica la disponibilidad de comandos esenciales."
  (interactive)
  (let ((commands '("gzip" "git" "ripgrep" "fd" "php" "composer" "stack")))
    (dolist (cmd commands)
      (message "%s: %s" cmd
               (if (executable-find cmd)
                   (propertize "✓ FOUND" 'face 'success)
                 (propertize "✗ NOT FOUND" 'face 'error))))))

;; ════════════════════════════════════════════════════════════════════════════
