config.el
;; INTERFAZ Y APARIENCIA
;; ════════════════════════════════════════════════════════════════════════════

;; --- Transparencia (compatible PGTK/Wayland y X11) ---
(defun set-frame-transparency (value)
  "Set frame transparency to VALUE (0-100).
En PGTK usa 'alpha-background, en X11 usa 'alpha."
  (if (featurep 'pgtk)
      ;; PGTK/Wayland: usa alpha-background con valor simple
      (progn
        (set-frame-parameter (selected-frame) 'alpha-background value)
        (add-to-list 'default-frame-alist `(alpha-background . ,value)))
    ;; X11: usa alpha con cons cell (active . inactive)
    (let ((alpha-value (cons value value)))
      (set-frame-parameter (selected-frame) 'alpha alpha-value)
      (add-to-list 'default-frame-alist `(alpha . ,alpha-value)))))

(set-frame-transparency 85)

(defun toggle-transparency ()
  "Toggle between transparent (85) and opaque (100)."
  (interactive)
  (let* ((param (if (featurep 'pgtk) 'alpha-background 'alpha))
         (current (frame-parameter nil param))
         (current-value (if (listp current) (car current) current)))
    (set-frame-transparency
     (if (and current-value (< current-value 100)) 100 85))))

;; --- Configuración de Fuentes ---
(require 'url)
(require 'auth-source)

(defvar my-nerd-fonts
  '("Hack Nerd Font"          ; principal (la primera disponible se elige)
    "JetBrainsMono Nerd Font"
    "VictorMono Nerd Font"    ; tambien usada para italicas (font-lock-comment)
    "FiraCode Nerd Font"
    "Iosevka Nerd Font"
    "CaskaydiaCove Nerd Font")
  "Nerd Fonts preferidas en orden de prioridad.
La primera disponible en el sistema se usa como `doom-font'.
Para anadir mas para el selector interactivo: `change-font'.")

(defvar safe-fonts
  '("Hack Nerd Font" "DejaVu Sans Mono" "Courier New" "Consolas" "Monospace")
  "Lista de fuentes seguras como fallback.")

(defun font-available-p (font-name)
  "Check if FONT-NAME is available."
  (find-font (font-spec :name font-name)))

(defun find-first-available-font (font-list)
  "Find first available font from FONT-LIST."
  (cl-find-if #'font-available-p font-list))

(defun download-and-install-nerd-font (font-name)
  "Download and install FONT-NAME from Nerd Fonts releases."
  (let* ((github-font-name (replace-regexp-in-string " Nerd Font$" "" font-name))
         (font-url (format "https://github.com/ryanoasis/nerd-fonts/releases/download/v3.2.1/%s.zip"
                           github-font-name))
         (temp-file (make-temp-file "nerd-font-" nil ".zip"))
         (font-dir (expand-file-name "~/.local/share/fonts/")))
    (message "Downloading %s..." font-name)
    (url-copy-file font-url temp-file t)
    (make-directory font-dir t)
    (call-process "unzip" nil nil nil "-o" temp-file "-d" font-dir)
    (delete-file temp-file)
    (when (eq system-type 'gnu/linux)
      (call-process "fc-cache" nil nil nil "-f" "-v"))
    (message "Successfully installed %s" font-name)))

(defun select-and-install-nerd-font ()
  "Interactively select and install a Nerd Font."
  (interactive)
  (let ((chosen-font (completing-read "Choose a Nerd Font to install: " my-nerd-fonts)))
    (when (yes-or-no-p (format "Download and install %s?" chosen-font))
      (download-and-install-nerd-font chosen-font))))

(defun setup-fonts ()
  "Setup main font configuration."
  (let* ((base-font-size 18)
         (nerd-font (find-first-available-font my-nerd-fonts))
         (safe-font (find-first-available-font safe-fonts))
         (main-font-family (or nerd-font safe-font))
         (variable-pitch-family "DejaVu Sans"))
    (when main-font-family
      (setq doom-font (font-spec :family main-font-family :size base-font-size)
            doom-variable-pitch-font (font-spec :family variable-pitch-family :size base-font-size)
            doom-big-font (font-spec :family main-font-family :size (* base-font-size 1.5))
            doom-italic-font (font-spec :family "VictorMono Nerd Font" :slant 'italic :size base-font-size)
            doom-bold-font (font-spec :family main-font-family :weight 'bold :size base-font-size))
      (when (display-graphic-p)
        (set-face-attribute 'default nil :font doom-font)
        (set-face-attribute 'fixed-pitch nil :font doom-font)
        (set-face-attribute 'variable-pitch nil :font doom-variable-pitch-font))
      (message "Font configured: %s" main-font-family))))

(setup-fonts)

;; Frames de terminal (emacsclient -t): pintar el fondo SOLIDO del theme,
;; como hace `emacs -nw'. Por defecto el daemon les deja bg "black"/transparente
;; (se ve el fondo del terminal). BLINDADO: solo forzamos el fondo si el frame
;; es truecolor (>=16M colores); en 256 colores un bg oscuro desaturado cuantiza
;; a azul feo, asi que ahi no tocamos. El daemon va en truecolor si arranca con
;; COLORTERM=truecolor (lo pone xmonad al lanzarlo).
(defun my/tty-frame-solid-bg (&optional frame)
  "Pintar en FRAME (o el actual), si es terminal truecolor, el fondo del theme."
  (let ((frame (or frame (selected-frame))))
    (when (and frame
               (not (display-graphic-p frame))
               (>= (display-color-cells frame) 16777216)
               (fboundp 'doom-color))
      (let ((bg (doom-color 'bg)))
        (when (stringp bg)
          (set-frame-parameter frame 'background-color bg)
          (set-face-background 'default bg frame))))))

;; En daemon, al cargar config.el todavia no hay display grafico, asi que
;; find-font falla y `doom-font' queda nil: los frames nuevos del cliente
;; caen a un fallback chico (Hack 13 en vez de tu 18). Y los frames TTY no
;; cogen el fondo del theme. Re-aplicar fuente + fondo al crear cada frame,
;; cuando ya hay display y find-font/doom-color funcionan.
(when (daemonp)
  (add-hook 'server-after-make-frame-hook #'setup-fonts)
  (add-hook 'server-after-make-frame-hook #'my/tty-frame-solid-bg))

;; Comentarios y keywords en cursiva con Victor Mono.
;; Linea de ejecucion en dape: magenta Spacemacs, fondo solido,
;; texto blanco bold. :extend t para que ocupe toda la linea.
(custom-set-faces!
  '(font-lock-comment-face :family "VictorMono Nerd Font" :slant italic)
  '(font-lock-doc-face :family "VictorMono Nerd Font" :slant italic)
  '(font-lock-keyword-face :slant italic)
  '(dape-source-line-face
    :background "#bc6ec5" :foreground "#ffffff"
    :weight bold :extend t))

(defun change-font ()
  "Interactively change the current font."
  (interactive)
  (when (display-graphic-p)
    (let* ((chosen-font (completing-read "Choose a font: " my-nerd-fonts))
           (base-font-size 14))
      (if (font-available-p chosen-font)
          (progn
            (setq doom-font (font-spec :family chosen-font :size base-font-size)
                  doom-big-font (font-spec :family chosen-font :size (* base-font-size 1.5))
                  doom-variable-pitch-font (font-spec :family "DejaVu Sans" :size base-font-size))
            (set-face-attribute 'default nil :font doom-font)
            (set-face-attribute 'fixed-pitch nil :font doom-font)
            (set-face-attribute 'variable-pitch nil :font doom-variable-pitch-font)
            (message "Font changed to %s" chosen-font))
        (when (yes-or-no-p (format "%s not installed. Download it?" chosen-font))
          (download-and-install-nerd-font chosen-font)
          (change-font))))))

(defun reload-fonts ()
  "Reload font configuration."
  (interactive)
  (when (display-graphic-p)
    (setup-fonts)
    (doom/reload-font)))

;; --- Ligaduras ---
(when (display-graphic-p)
  (use-package! ligature
    :config
    (ligature-set-ligatures
     't '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
          ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
          "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
          "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
          "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
          "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
          "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
          "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
          "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
          "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
    (global-ligature-mode t)))

;; --- Tema ---
(use-package! doom-themes
  :config
  (setq doom-themes-org-font "-apple-Pacifico-Regular-normal-normal-*-14-*-*-*-m-0-iso10646-1"))

;; ════════════════════════════════════════════════════════════════════════════
;; ORG MODE
;; ════════════════════════════════════════════════════════════════════════════
