config.org
* ORG MODE

#+begin_src emacs-lisp

(setq org-directory "~/org/"
      org-roam-directory "~/org/roam")

;; Configuración de exportación HTML
(with-eval-after-load 'ox-html
  (setq org-html-postamble nil
        org-html-head-include-default-style nil
        org-html-head-include-scripts nil
        org-html-doctype "html5"
        org-html-html5-fancy t
        org-html-validation-link nil
        org-html-template-default-path "/home/passh/org/template_spacemacs.html"))

;; Configuración adicional de Org
(after! org
  (setq org-startup-with-inline-images t
        org-export-allow-bind-keywords t)

  ;; Org-crypt para encriptación
  (require 'org-crypt)
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance '("crypt")
        org-crypt-key "85E4C775557B92E4")

  ;; Cifra los heredia :crypt: antes de cada save de cualquier buffer org-mode.
  ;; Antes el hook estaba en kill-buffer-hook (cifraba solo al matar buffer):
  ;; el fichero podia quedar en disco con contenido en claro entre saves.
  (add-hook! 'before-save-hook
    (defun +org-encrypt-before-save ()
      (when (derived-mode-p 'org-mode)
        (org-encrypt-entries)))))

;; Org-roam
(org-roam-db-autosync-mode)

;; org-roam-ui: grafo interactivo en el navegador (D3.js). M-x org-roam-ui-mode.
(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t          ; usa el tema de Doom
        org-roam-ui-follow t              ; sigue el nodo donde estas
        org-roam-ui-update-on-save t      ; refresca el grafo al guardar
        org-roam-ui-open-on-start t)      ; al activar el modo, abre el grafo

  ;; FIX IPv6: org-roam-ui sirve por 127.0.0.1, pero `org-roam-ui-open' abre
  ;; por "localhost", que en este sistema resuelve a ::1 (IPv6). La pagina
  ;; carga (HTTP cae a IPv4) pero el WEBSOCKET (puerto+2) pega contra ::1 y no
  ;; engancha -> el grafo se queda "cargando" eterno. Forzamos IPv4 en la URL
  ;; para que pagina y websocket vayan al mismo 127.0.0.1.
  (defun my/org-roam-ui-open ()
    "Como `org-roam-ui-open' pero por 127.0.0.1 (evita el cuelgue IPv6/::1)."
    (interactive)
    (unless (bound-and-true-p org-roam-ui-mode) (org-roam-ui-mode))
    (funcall org-roam-ui-browser-function
             (format "http://127.0.0.1:%d" org-roam-ui-port)))
  (advice-add 'org-roam-ui-open :override #'my/org-roam-ui-open))

;; Org Journal
(use-package! org-journal
  :config
  (setq org-journal-dir "~/org/journal/"
        org-journal-file-type 'monthly
        org-journal-file-format "%Y%m.org"
        org-journal-date-format "%A, %d %B %Y"
        org-journal-time-format "%H:%M "
        org-journal-file-header "#+TITLE: Journal de passh %Y-%m\n"
        org-journal-carryover-items "TODO=\"TODO\"|TODO=\"IN-PROGRESS\"|TODO=\"IN-REVIEW\"|TODO=\"IN-TEST\"|TODO=\"DONE\"|TODO=\"CANCELLED\"|TODO=\"RELEASED\"|TODO=\"MERGED\"|TODO=\"DEPLOYED\"|TODO=\"CLOSED\"|TODO=\"REOPENED\"|TODO=\"REJECTED\""
        org-journal-enable-agenda-integration t
        org-journal-enable-encryption nil
        org-journal-hide-entries-p nil)

  (make-directory org-journal-dir t)
  (setq org-agenda-files (append org-agenda-files (list org-journal-dir))))
#+end_src

