config.org
* GOOGLE CALENDAR (org-gcal + calfw)

#+begin_src emacs-lisp

;; Lee credenciales OAuth de agenix -> pass -> warn (mismo patron que
;; my/get-intelephense-key). Devuelve (cons client-id client-secret) o nil.
;; Formato del .age (2 lineas): client-id en linea 1, secret en linea 2.
(defun my/get-google-oauth-creds ()
  "Obtiene OAuth Google (client-id . client-secret) para org-gcal.
Orden: agenix -> pass -> nil + warn."
  (let* ((secrets-dir (expand-file-name "~/dotfiles/secrets/"))
         (age-file (expand-file-name "google-oauth-emacs.age" secrets-dir))
         (creds
          (or
           ;; 1. agenix
           (and (executable-find "agenix")
                (file-readable-p age-file)
                (let* ((default-directory secrets-dir)
                       (out (shell-command-to-string
                             "agenix -d google-oauth-emacs.age 2>/dev/null")))
                  (let ((lines (split-string out "\n" t " *")))
                    (when (>= (length lines) 2)
                      (cons (nth 0 lines) (nth 1 lines))))))
           ;; 2. pass (dos entradas separadas)
           (and (executable-find "pass")
                (let ((id (string-trim
                           (shell-command-to-string
                            "pass show web/google-oauth-emacs-client-id 2>/dev/null | head -1")))
                      (sec (string-trim
                            (shell-command-to-string
                             "pass show web/google-oauth-emacs-client-secret 2>/dev/null | head -1"))))
                  (when (and (not (string-empty-p id))
                             (not (string-empty-p sec)))
                    (cons id sec)))))))
    (unless creds
      (message "[org-gcal] credenciales no encontradas (ni agenix ni pass). Sync no funcionara."))
    creds))

(use-package! org-gcal
  :defer t
  :config
  (let ((creds (my/get-google-oauth-creds)))
    (when creds
      (setq org-gcal-client-id     (car creds)
            org-gcal-client-secret (cdr creds))
      ;; CRITICO: org-gcal solo registra el provider en oauth2-auto al
      ;; cargar el paquete, cuando aun NO hemos seteado las credenciales
      ;; (van en este :config). Hay que re-registrar a mano tras setearlas,
      ;; si no oauth2-auto-additional-providers-alist queda vacio y el
      ;; OAuth peta. Esta linea lo arregla.
      (org-gcal-reload-client-id-secret)))

  ;; Mapeo calendario Google -> fichero org local.
  ;; - personal: la cuenta Gmail principal de Pascual.
  ;; - family:   calendario compartido con Cristina (creado por Ambrosio efimero).
  ;; - curro:    deshabilitado por defecto (Vocento es cuenta separada).
  ;;             Para activar: descomentar y verificar el ID.
  (setq org-gcal-fetch-file-alist
        '(("pascual.munoz.galian@gmail.com" . "~/org/calendar/personal.org")
          ("f084a140a73e530b1f474b6a3ba44e59c32f34a7016abb003e59780e710eca8c@group.calendar.google.com"
           . "~/org/calendar/family.org")
          ;; ("<id-curro>@group.calendar.google.com" . "~/org/calendar/curro.org")
          ))

  ;; Recordatorios por defecto al crear evento desde Emacs.
  (setq org-gcal-recurring-events-mode 'top-level
        org-gcal-remove-api-cancelled-events t)

  ;; Anadir los .org de calendar al org-agenda para verlos unificados.
  (dolist (file (mapcar #'cdr org-gcal-fetch-file-alist))
    (add-to-list 'org-agenda-files (expand-file-name file))))

;; Vista calendario tipo cuadricula (calfw).
(use-package! calfw
  :defer t
  :commands (cfw:open-org-calendar))
(use-package! calfw-org
  :defer t
  :after calfw)

;; Atajos: SPC l g <letra> para Google Calendar.
(map! :leader
      (:prefix ("l g" . "google calendar")
       :desc "Fetch (pull events)"     "f" #'org-gcal-fetch
       :desc "Sync (push + pull)"      "s" #'org-gcal-sync
       :desc "Post-at-point (push)"    "p" #'org-gcal-post-at-point
       :desc "Delete-at-point"         "d" #'org-gcal-delete-at-point
       :desc "Vista calfw (org)"       "v" #'cfw:open-org-calendar
       :desc "Abrir personal.org"      "P" (lambda () (interactive) (find-file "~/org/calendar/personal.org"))
       :desc "Abrir family.org"        "F" (lambda () (interactive) (find-file "~/org/calendar/family.org"))))

;; Función para insertar imágenes desde el portapapeles.
;; Detecta Wayland (PGTK) -> wl-paste; resto -> xclip.
(defun brutalist-clipboard-png-insert ()
  "Insert PNG image from clipboard into Org file."
  (interactive)
  (let* ((timestamp (format-time-string "%Y%m%d_%H%M%S"))
         (image-dir (expand-file-name "~/org/images/"))
         (image-name (concat timestamp ".png"))
         (image-path (expand-file-name image-name image-dir))
         (wayland-p (or (featurep 'pgtk)
                        (getenv "WAYLAND_DISPLAY")))
         (cmd (if wayland-p
                  '("wl-paste" "--type" "image/png")
                '("xclip" "-selection" "clipboard" "-t" "image/png" "-o")))
         (tool (car cmd)))

    (unless (executable-find tool)
      (error "%s no esta instalado (necesario para %s)"
             tool (if wayland-p "Wayland" "X11")))

    (unless (file-directory-p image-dir)
      (make-directory image-dir t))

    (let ((clip-output
           (with-temp-buffer
             (let ((coding-system-for-read 'binary)
                   (coding-system-for-write 'binary))
               (if (zerop (apply #'call-process (car cmd) nil t nil (cdr cmd)))
                   (progn
                     (write-region (point-min) (point-max) image-path nil 'silent)
                     (buffer-string))
                 (error "Failed to get PNG data from clipboard (via %s)" tool))))))

      (when (and clip-output (> (length clip-output) 0))
        (insert (format "[[file:%s]]" image-path))
        (message "Image inserted: %s" image-path)))))
#+end_src

