config.org
* LENGUAJES DE PROGRAMACIÓN

#+begin_src emacs-lisp

;; --- Babel ---
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (haskell . t)
   (php . t)
   (nix . t)))

;; --- PHP & Intelephense ---
(after! php-mode
  (setq php-mode-coding-style 'psr2))

;; Lee la licencia de Intelephense. Orden: agenix -> pass -> warning.
;; NUNCA hardcodear la key aqui (el repo es publico).
;;   1. agenix: ~/dotfiles/secrets/intelephense-license.age (declarativo,
;;      replica clone-first, descifra con ssh key del usuario).
;;   2. pass:   personal/intelephense-license (gpg, fuente activa).
;;   3. nil + message de aviso.
(defun my/get-intelephense-key ()
  "Obtiene la licencia de Intelephense (/run/agenix -> agenix -> pass -> nil)."
  (let* ((secrets-dir (expand-file-name "~/dotfiles/secrets/"))
         (age-file (expand-file-name "intelephense-license.age" secrets-dir))
         (agenix-runtime "/run/agenix/intelephense-license")
         (key (or
               ;; 0. /run/agenix: agenix lo descifra al boot con la HOST key
               ;;    (recipient en TODA maquina) -> simple file read. No depende
               ;;    de la user key del clon (passh@macbook != passh@aurin) ni
               ;;    del pinentry de gpg. Es la fuente preferida.
               (and (file-readable-p agenix-runtime)
                    (let ((out (string-trim
                                (with-temp-buffer
                                  (insert-file-contents agenix-runtime)
                                  (car (split-string (buffer-string) "\n"))))))
                      (and (not (string-empty-p out)) out)))
               ;; 1. agenix CLI (solo si TU user key es recipient, p.ej. aurin)
               (and (executable-find "agenix")
                    (file-readable-p age-file)
                    (let* ((default-directory secrets-dir)
                           (out (string-trim
                                 (shell-command-to-string
                                  "agenix -d intelephense-license.age 2>/dev/null | head -1"))))
                      (and (not (string-empty-p out)) out)))
               ;; 2. pass
               (and (executable-find "pass")
                    (let ((out (string-trim
                                (shell-command-to-string
                                 "pass show personal/intelephense-license 2>/dev/null | head -1"))))
                      (and (not (string-empty-p out)) out))))))
    (unless key
      (message "[intelephense] Key no encontrada (ni agenix ni pass). LSP arrancara sin licencia premium."))
    key))

(after! lsp-mode
  ;; Rendimiento LSP general (read-process-output-max, lsp-idle-delay,
  ;; lsp-log-io, lsp-file-watch-threshold): centralizado en la seccion
  ;; RENDIMIENTO mas abajo, fuente unica de verdad. gc-cons-threshold lo
  ;; gestiona gcmh-mode (NO forzar valor estatico). Aqui solo Intelephense.

  ;; Configuración de Intelephense
  (setq lsp-intelephense-licence-key (or (my/get-intelephense-key) "")
        lsp-intelephense-storage-path (expand-file-name "~/.config/emacs/.local/cache/intelephense")
        lsp-intelephense-files-max-size 5000000  ; 5MB
        lsp-intelephense-max-memory 4096         ; 4GB
        lsp-intelephense-multi-root nil
        lsp-intelephense-environment-php-version "8.3")

  ;; Optimizaciones de rendimiento
  (setq lsp-enable-file-watchers nil
        lsp-enable-folding nil
        lsp-enable-links nil
        lsp-enable-symbol-highlighting nil
        lsp-enable-text-document-color nil)

  ;; Personalización de completado
  (setq lsp-intelephense-completion-insert-use-declarations t
        lsp-intelephense-completion-fully-qualify-global-constants-and-functions nil)

  ;; Configuración de diagnóstico
  (setq lsp-intelephense-diagnostics-undefined-methods t
        lsp-intelephense-diagnostics-undefined-functions t
        lsp-intelephense-diagnostics-undefined-constants t
        lsp-intelephense-diagnostics-undefined-classes t
        lsp-intelephense-diagnostics-undefined-properties t)

  ;; Telemetría
  (setq lsp-intelephense-telemetry-enabled nil
        lsp-intelephense-format-enable t))

;; Funciones de utilidad para PHP/LSP
(defun force-intelephense-restart ()
  "Force restart Intelephense server."
  (interactive)
  (when (lsp-workspaces)
    (lsp-workspace-shutdown (lsp-workspaces)))
  (delete-directory (expand-file-name "~/.config/emacs/.local/cache/intelephense") t)
  (garbage-collect)
  (lsp))

(defun toggle-intelephense-debug ()
  "Toggle Intelephense debug mode."
  (interactive)
  (setq lsp-log-io (not lsp-log-io))
  (message "Intelephense debug: %s" (if lsp-log-io "ON" "OFF")))

;; Hook para PHP
(add-hook! php-mode
  (setq-local lsp-enable-file-watchers nil
              lsp-enable-indentation nil)
  (lsp-deferred))
#+end_src

* HERRAMIENTAS DE DESARROLLO

#+begin_src emacs-lisp

;; --- Projectile ---
;; search-path: ~/src/ recursivo + ~/dotfiles. Vocento esta en ~/src/vocento
;; (subdir, ya detectado). NUNCA poner ~/ aqui (escanearia todo el home).
(setq projectile-project-search-path '("~/src/" "~/dotfiles/"))

;; Salvaguarda: $HOME tiene .git por los dotfiles, ignorar como proyecto.
(after! projectile
  (add-to-list 'projectile-ignored-projects (expand-file-name "~/")))

;; --- PlantUML ---
;; Usar el ejecutable de NixOS en lugar del jar
(after! plantuml-mode
  (setq plantuml-executable-path "plantuml"
        plantuml-default-exec-mode 'executable))

;; --- Telega ---
;; Usar variable de entorno para evitar hardcodear path de Nix store
(setq telega-server-libs-prefix (getenv "TDLIB_PREFIX"))
;; --- GitHub Copilot ---
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word))
  :config
  ;; idle-delay 0.3: balance entre responsividad y ruido/coste de API.
  ;; 0.1 disparaba peticion cada 100ms, demasiado agresivo.
  (setq copilot-idle-delay 0.3
        copilot-max-char 100000)
  ;; Desactivar warnings de manera correcta
  (add-to-list 'warning-suppress-types '(copilot))
  (add-to-list 'warning-suppress-log-types '(copilot)))

;; --- Persistencia de sesion (workspaces autoload) ---
;; Doom autoguarda la sesion (persp-mode) al matar Emacs, pero NO la carga
;; al arrancar. Este hook lo hace en GUI -- en daemon puro espera al primer
;; frame. Solo si existe sesion guardada previamente.
;; Guardado manual: `SPC q s` o M-x +workspace/save-session.
;; Carga manual:    `SPC q l` o M-x +workspace/load-session.
;;
;; Defensivo: persp-mode es lazy en Doom y persp-auto-save-fname/save-dir
;; no estan bound hasta primer uso. require + boundp + condition-case para
;; que un fallo NO reviente doom-after-init-hook (y rompa keybindings).
(defun +my/auto-load-session-h ()
  "Cargar ultima sesion de workspaces si existe."
  (when (display-graphic-p)
    (condition-case err
        (when (and (require 'persp-mode nil t)
                   (boundp 'persp-auto-save-fname)
                   (boundp 'persp-save-dir)
                   (fboundp '+workspace/load-session)
                   (file-exists-p
                    (expand-file-name persp-auto-save-fname persp-save-dir)))
          (+workspace/load-session))
      (error (message "[autoload-session] no se pudo cargar sesion: %s"
                      (error-message-string err))))))

(add-hook 'doom-after-init-hook #'+my/auto-load-session-h)

;; --- GPTel (Ollama) ---
(use-package! gptel
  :config
  (setq gptel-backend (gptel-make-ollama "Ollama"
                        :host "localhost:11434"
                        :stream t
                        :models '("llama3.1:latest"))
        gptel-model "llama3.1:latest"
        gptel-default-mode 'org-mode
        gptel-directives
        '((default . "Eres un asistente AI especializado en Emacs Doom, Haskell, y configuración de entornos de desarrollo. Proporciona atajos de Doom Emacs cuando sea relevante."))))
#+end_src

