config.org
* FUNCIONES PERSONALIZADAS

#+begin_src emacs-lisp

(defun copy-whole-buffer-to-clipboard ()
  "Copy entire buffer to clipboard."
  (interactive)
  (clipboard-kill-ring-save (point-min) (point-max))
  (message "Buffer copied to clipboard"))
#+end_src

* KEYBINDINGS

#+begin_src emacs-lisp

(map! :leader
      ;; Toggle
      (:prefix ("t" . "toggle")
       :desc "Change font" "a" #'change-font
       :desc "Reload fonts" "A" #'reload-fonts
       :desc "Install Nerd Font" "I" #'select-and-install-nerd-font
       :desc "Toggle transparency" "t" #'toggle-transparency)

      ;; Journal
      (:prefix ("j" . "journal")
       :desc "New entry" "j" #'org-journal-new-entry
       :desc "Next entry" "n" #'org-journal-open-next-entry
       :desc "Previous entry" "p" #'org-journal-open-previous-entry
       :desc "Search" "s" #'org-journal-search)

      ;; Yank
      :desc "Copy buffer" "y b" #'copy-whole-buffer-to-clipboard

      ;; Diagnostics
      :desc "Verify commands" "d v" #'verify-essential-commands)

;; Keybindings locales para PHP
(map! :after php-mode
      :map php-mode-map
      :localleader
      (:prefix ("l" . "lsp")
               "R" #'force-intelephense-restart
               "d" #'toggle-intelephense-debug
               "i" #'lsp-intelephense-index-workspace))

;; Keybinding global para insertar imágenes
(global-set-key (kbd "S-<print>") 'brutalist-clipboard-png-insert)
#+end_src

* CONFIGURACIÓN HASKELL + HLS

#+begin_src emacs-lisp

;; Configuración mínima: Doom maneja todo automáticamente con +lsp +tree-sitter
;; Ver guía completa de comandos en: ~/src/pensando-en-haskell/README.org
;; Busca la sección "🎯 Doom Emacs: Guía Completa de Comandos"

(after! lsp-haskell
  ;; Solo configuramos fourmolu como formateador
  (setq lsp-haskell-formatting-provider "fourmolu"))

(setq haskell-interactive-popup-errors nil) ; Deshabilitar popups de errores

;; Flycheck haskell-stack-ghc no usa nuestro proyecto (cabal-based) y
;; ademas peta con caracteres unicode en el codigo. Desactivado.
(after! flycheck
  (add-to-list 'flycheck-disabled-checkers 'haskell-stack-ghc))
#+end_src

* NIX-MODE FIX

#+begin_src emacs-lisp
;; Fix: font-lock no se activa automáticamente en algunos casos
(add-hook 'nix-mode-hook #'font-lock-ensure)
#+end_src

