config.el
;; DAPE - Debug Adapter Protocol
;; ════════════════════════════════════════════════════════════════════════════

;; Función para instalar vscode-php-debug automáticamente
(defun dape-ensure-php-debug-adapter ()
  "Instala vscode-php-debug adapter si no existe."
  (let* ((adapter-dir (expand-file-name "~/.config/doom/debug-adapters/php-debug"))
         (adapter-file (expand-file-name "extension/out/phpDebug.js" adapter-dir))
         (download-url "https://github.com/xdebug/vscode-php-debug/releases/download/v1.35.0/php-debug-1.35.0.vsix")
         (temp-file (make-temp-file "php-debug-" nil ".vsix")))

    (unless (file-exists-p adapter-file)
      (message "📦 Instalando vscode-php-debug adapter...")

      ;; Crear directorio
      (make-directory (expand-file-name "~/.config/doom/debug-adapters") t)

      ;; Descargar .vsix
      (url-copy-file download-url temp-file t)
      (message "✓ Descargado adaptador")

      ;; Descomprimir
      (call-process "unzip" nil nil nil "-q" temp-file "-d" adapter-dir)
      (delete-file temp-file)
      (message "✓ Adaptador instalado en %s" adapter-dir)

      ;; Verificar instalación
      (if (file-exists-p adapter-file)
          (message "✅ vscode-php-debug adapter instalado correctamente")
        (error "❌ Error instalando el adaptador")))

    ;; Retornar true si existe
    (file-exists-p adapter-file)))

;; Atajos dape estilo IntelliJ IDEA. Globales y unbound previamente.
;; Solo hacen algo cuando hay sesion de debug activa - si no, dan
;; "No active debug session" sin romper nada.
(map! "<f7>"   #'dape-step-in              ; IntelliJ F7      (entra en funcion)
      "<f8>"   #'dape-next                 ; IntelliJ F8      (step over)
      "<S-f8>" #'dape-step-out             ; IntelliJ Shift+F8 (sale de funcion)
      "<f9>"   #'dape-continue             ; IntelliJ F9      (resume)
      "<C-f8>" #'dape-breakpoint-toggle    ; IntelliJ Ctrl+F8 (toggle breakpoint)
      "<C-f2>" #'dape-quit                 ; IntelliJ Ctrl+F2 (stop)
      "<M-f8>" #'dape-evaluate-expression) ; IntelliJ Alt+F8  (evaluate expression)

(use-package! dape
  :config
  ;; hdb (Haskell Debugger) en el primer launch tarda 15-30s descubriendo
  ;; flags via hie-bios + cabal path + ghc --print-libdir. Default 10s
  ;; mata la conexion antes de que hdb conteste.
  (setq dape-request-timeout 60)
  ;; PHP con Xdebug 3.x usando vscode-php-debug
  ;; NOTA: No usamos 'ensure' automático porque causa errores al cargar la config.
  ;; Para instalar/reinstalar el adaptador manualmente: M-x dape-ensure-php-debug-adapter
  (add-to-list 'dape-configs
               `(phpListen
                 modes (php-mode)
                 command "node"
                 command-args (,(expand-file-name "~/.config/doom/debug-adapters/php-debug/extension/out/phpDebug.js"))
                 :type "php"
                 :request "launch"
                 :mode "listen"
                 :port 9003))

  ;; Haskell con hdb (DAP debugger de Well-Typed, requiere GHC 9.14+)
  ;;
  ;; Como funciona (replica lo que la extension VSCode oficial hace):
  ;;   1. dape pide un puerto libre (autoport).
  ;;   2. Lanza `hdb-dap server --port <port>` (wrapper que entra en
  ;;      `nix develop` antes de hdb, asegurando GHC 9.14 en PATH).
  ;;   3. dape conecta TCP a localhost:<port>.
  ;;   4. Manda launch request con projectRoot + entryFile + entryPoint.
  ;;
  ;; Instalacion previa (una sola vez):
  ;;   cd <proyecto-haskell-con-flake> && nix develop
  ;;   cabal install haskell-debugger --installdir=$HOME/.local/bin
  ;;   (el wrapper hdb-dap esta en dotfiles, ya en PATH)
  (add-to-list 'dape-configs
               `(haskell-hdb
                 modes (haskell-mode haskell-ts-mode haskell-cabal-mode)
                 ensure (lambda (config)
                          (unless (executable-find "hdb-dap")
                            (user-error
                             "hdb-dap no encontrado en PATH. Verifica ~/.local/bin/hdb-dap")))
                 fn (dape-config-autoport)
                 host "localhost"
                 port :autoport
                 ;; hdb-dap = wrapper bash que sube buscando flake.nix y
                 ;; ejecuta `nix develop --command hdb "$@"`. Necesario
                 ;; porque hdb hace abort si encuentra GHC distinto del
                 ;; 9.14 con el que fue compilado, y el emacs daemon no
                 ;; vive dentro de nix develop por defecto. (Fix
                 ;; sensei 2026-05-25)
                 command "hdb-dap"
                 command-args ("server" "--port" :autoport)
                 :type "haskell-debugger"
                 :request "launch"
                 :projectRoot dape-cwd-fn
                 :entryFile dape-buffer-default
                 :entryPoint "main"
                 :entryArgs []
                 :extraGhcArgs []
                 ;; internal-interpreter = true: usa el interprete GHCi
                 ;; embebido en el proceso hdb en lugar de spawnar un
                 ;; subprocess externo. Cada launch arranca mas rapido
                 ;; al saltarse la sincronizacion via pipes con el proceso
                 ;; externo. Trade-off: el debuggee comparte la heap del
                 ;; debugger, lo cual va bien para programas pequenos
                 ;; (este Debugging101 lo es). Para programas grandes
                 ;; volver a nil.
                 :internalInterpreter t)))

;; Comando interactivo para reinstalar el adaptador
(defun dape-reinstall-php-debug-adapter ()
  "Reinstala vscode-php-debug adapter forzosamente."
  (interactive)
  (let ((adapter-dir (expand-file-name "~/.config/doom/debug-adapters/php-debug")))
    (when (file-exists-p adapter-dir)
      (delete-directory adapter-dir t)
      (message "🗑️  Adaptador anterior eliminado"))
    (dape-ensure-php-debug-adapter)))

;; ═══════════════════════════════════════════════════════════════════════
