config.org
* BEHAT: saltar de un step Gherkin a su definicion PHP (estilo PhpStorm)

#+begin_src emacs-lisp
;; En un .feature, `gd' sobre un step (Given/When/Then) salta al metodo PHP
;; cuya anotacion @Given/@When/@Then casa con el. Soporta placeholders
;; (:param) y /regex/. Si varios casan, ofrece elegir. Indexa los Context
;; con ripgrep, asi que es instantaneo aunque haya cientos de steps.

(defun my/behat--strip-keyword (line)
  "Quita la keyword Gherkin (ES/EN) y espacios del principio de LINE."
  (replace-regexp-in-string
   "\\`[ \t]*\\(?:Given\\|When\\|Then\\|And\\|But\\|Dado\\|Dada\\|Cuando\\|Entonces\\|Y\\|Pero\\|\\*\\)[ \t]+"
   "" (string-trim line)))

(defun my/behat--annot->regexp (annot)
  "Convierte ANNOT (texto tras @Given/@When/@Then) en un regexp Emacs anclado.
Soporta placeholder (:param) y /regex/. Devuelve nil si no compila."
  (condition-case nil
      (let ((a (string-trim annot)))
        (if (string-match "\\`/\\(.*\\)/[a-z]*\\'" a)
            ;; estilo regex PCRE -> conversion minima a Emacs
            (let ((re (match-string 1 a)))
              (setq re (replace-regexp-in-string "\\\\d" "[0-9]" re))
              (setq re (replace-regexp-in-string "\\\\w" "[A-Za-z0-9_]" re))
              (setq re (replace-regexp-in-string "(\\?:" "\x01" re)) ; preserva (?:
              (setq re (replace-regexp-in-string "(" "\\\\(?:" re))
              (setq re (replace-regexp-in-string ")" "\\\\)" re))
              (setq re (replace-regexp-in-string "\x01" "\\\\(?:" re))
              (and (ignore-errors (string-match-p re "") t) re))
          ;; estilo placeholder :param
          (let ((q (regexp-quote a)))
            (concat "\\`"
                    (replace-regexp-in-string
                     ":[A-Za-z_][A-Za-z0-9_]*"
                     "\\\\(?:\"[^\"]*\"\\\\|[^ ]+\\\\)"
                     q)
                    "\\'"))))
    (error nil)))

(defun my/behat--collect-steps (root)
  "Lista (ANOTACION FICHERO LINEA) de los steps en los *Context.php de ROOT."
  (let ((default-directory root) (out '()))
    (dolist (line (ignore-errors
                    (process-lines "rg" "--no-heading" "--line-number" "--no-config"
                                   "-o" "@(?:Given|When|Then)\\s+(.+?)\\s*$"
                                   "-r" "$1" "-g" "*Context.php" "-g" "!vendor")))
      (when (string-match "\\`\\([^:]+\\):\\([0-9]+\\):\\(.*\\)\\'" line)
        (push (list (replace-regexp-in-string
                     ;; docblocks de UNA linea `/** @Then texto */' dejan el
                     ;; ` */' final pegado a la anotacion; quitarlo o no casa.
                     "[ \t]*\\*/[ \t]*\\'" "" (match-string 3 line))
                    (expand-file-name (match-string 1 line) root)
                    (string-to-number (match-string 2 line)))
              out)))
    (nreverse out)))

(defun my/behat--jump (cand)
  "Abre el fichero y va a la linea de CAND (ANOTACION FICHERO LINEA)."
  (find-file (nth 1 cand))
  (goto-char (point-min))
  (forward-line (1- (nth 2 cand)))
  (recenter)
  (when (fboundp 'pulse-momentary-highlight-one-line)
    (pulse-momentary-highlight-one-line (point))))

(defun my/behat-goto-step ()
  "Saltar del step Gherkin bajo el cursor a su definicion PHP en los Context."
  (interactive)
  (let* ((root (my/behat--root))
         (step (my/behat--strip-keyword (or (thing-at-point 'line t) "")))
         (matches (cl-remove-if-not
                   (lambda (c) (let ((re (my/behat--annot->regexp (car c))))
                                 (and re (string-match-p re step))))
                   (my/behat--collect-steps root))))
    (cond
     ((null matches) (message "Behat: sin definicion para: %s" step))
     ((= 1 (length matches)) (my/behat--jump (car matches)))
     (t (let ((choice (completing-read "Step (varias defs): "
                                       (mapcar #'car matches) nil t)))
          (my/behat--jump (cl-find choice matches :key #'car :test #'string=)))))))

;; --- Ejecutar Behat desde el .feature (escenario bajo cursor o feature entera) ---
(defvar my/behat-command "bin/behat"
  "Ejecutable de Behat, relativo a la raiz del proyecto.")

(defvar my/behat-default-args "--tags '~@pendiente'"
  "Argumentos por defecto de Behat. Ajusta a tu gusto (o pon cadena vacia).")

(defun my/behat--root ()
  "Raiz del proyecto Behat REAL: el dir ancestro que contiene bin/behat
\(el microservicio), no el super-proyecto de projectile. Asi funciona aunque
tengas activo un proyecto-paraguas que agrupa varios micros. Cae a behat.yml,
luego a projectile, luego al directorio actual."
  (let ((file (or (buffer-file-name) default-directory)))
    (expand-file-name
     (or (locate-dominating-file
          file (lambda (d) (file-exists-p (expand-file-name "bin/behat" d))))
         (locate-dominating-file file "behat.yml")
         (and (fboundp 'projectile-project-root) (ignore-errors (projectile-project-root)))
         default-directory))))

(defvar my/behat-nix-develop t
  "Si non-nil y la raiz del proyecto tiene flake.nix, envuelve Behat en
`nix develop --command' para garantizar php/composer en PATH.")

(defun my/behat--run (&optional line)
  "Ejecuta Behat sobre el .feature del buffer, desde la raiz del MICRO.
Si LINE se da, corre SOLO el escenario que empieza en esa linea (fichero:LINE).

Si la raiz tiene flake.nix (y `my/behat-nix-develop'), ENVUELVE el comando
en `nix develop --command'. Antes heredabamos el entorno del buffer via
envrc, pero envrc exporta el entorno de forma ASINCRONA: si el test arranca
antes de que termine, php no esta en PATH y Behat peta con
`env: php: No such file or directory' (exit 127). El wrap es deterministico."
  (let* ((root (my/behat--root))
         (rel (file-relative-name (buffer-file-name) root))
         (target (if line (format "%s:%d" rel line) rel))
         (default-directory root)
         (inner (string-trim (format "%s %s %s"
                                     my/behat-command my/behat-default-args target)))
         (cmd (if (and my/behat-nix-develop
                       (file-exists-p (expand-file-name "flake.nix" root)))
                  (format "nix develop --command bash -c %s"
                          (shell-quote-argument inner))
                inner)))
    (compile cmd)))

(defun my/behat-run-scenario ()
  "Ejecuta con Behat solo el escenario bajo el cursor."
  (interactive)
  (my/behat--run (line-number-at-pos)))

(defun my/behat-run-feature ()
  "Ejecuta con Behat toda la feature del buffer."
  (interactive)
  (my/behat--run))

(defvar my/behat-xdebug-port 9003
  "Puerto donde escucha el listener de dape (phpListen) para Xdebug 3.")

(defun my/behat--debug-run (&optional line)
  "Como `my/behat--run' pero ARRANCA una sesion de Xdebug.
Lanza php con xdebug.mode=debug + start_with_request=yes apuntando al
listener de dape (`my/behat-xdebug-port'), de modo que el proceso de
behat se conecta a dape y PARA en tus breakpoints.

PRE-REQUISITOS (en este orden):
  1. Pon breakpoints en el codigo PHP (FeatureContext, dominio...).
  2. Levanta el listener: M-x dape -> phpListen.
  3. Entonces SPC m d sobre el escenario.
Sin el listener arriba, php intenta conectar al 9003 y nadie descuelga
(no rompe, solo corre sin parar)."
  (let* ((root (my/behat--root))
         (rel (file-relative-name (buffer-file-name) root))
         (target (if line (format "%s:%d" rel line) rel))
         (default-directory root)
         (php-flags (format (concat "-dxdebug.mode=debug "
                                    "-dxdebug.start_with_request=yes "
                                    "-dxdebug.client_host=127.0.0.1 "
                                    "-dxdebug.client_port=%d")
                            my/behat-xdebug-port))
         ;; `php <flags> bin/behat' en vez de `bin/behat' directo: asi
         ;; inyectamos los -d de Xdebug (el shebang no deja pasarlos).
         (inner (string-trim (format "php %s %s %s %s"
                                     php-flags my/behat-command
                                     my/behat-default-args target)))
         (cmd (if (and my/behat-nix-develop
                       (file-exists-p (expand-file-name "flake.nix" root)))
                  (format "nix develop --command bash -c %s"
                          (shell-quote-argument inner))
                inner)))
    (compile cmd)))

(defun my/behat-debug-scenario ()
  "Debuggea con dape/Xdebug el escenario bajo el cursor (para en breakpoints)."
  (interactive)
  (my/behat--debug-run (line-number-at-pos)))

(after! feature-mode
  ;; El runner nativo de feature-mode apunta a Behat, no a cucumber (Ruby).
  (setq feature-cucumber-command "bin/behat {options} \"{feature}\"")
  (map! :map feature-mode-map
        ;; `gd' sobre un step salta a su definicion PHP, como el `gd' de codigo.
        :n "gd" #'my/behat-goto-step
        :localleader
        "g" #'my/behat-goto-step
        "v" #'my/behat-run-scenario    ; SPC m v: escenario bajo el cursor
        "V" #'my/behat-run-feature     ; SPC m V: feature entera
        "d" #'my/behat-debug-scenario  ; SPC m d: debug escenario con Xdebug
        "a" #'my/run-config-save-last  ; SPC m a: dar de ALTA la ultima ejecucion
        "l" #'my/run-config-launch))   ; SPC m l: lanzar una run-config guardada

;; "Rerun" estilo IntelliJ: re-lanza el ULTIMO test/comando desde DONDE SEA
;; (incluido tu buffer PHP mientras debuggeas), sin volver al .feature.
;; `recompile' recuerda el comando Y el directorio (el nix develop incluido).
;; Flujo: SPC m d una vez en el feature -> luego F5, F5, F5... las 100 veces.
(map! "<f5>" #'recompile)
#+end_src

