config.org
* Run configurations estilo IntelliJ

IntelliJ tiene un desplegable de "configuraciones de ejecucion" con nombre:
las das de alta una vez y las relanzas con un click. Esto replica lo esencial
sin paquetes externos, encima de =compile=.

Filosofia: corres algo (=SPC m V=, =SPC m d=, o cualquier =compile=), lo das
de ALTA con un nombre, y luego lo eliges y lo lanzas desde donde sea. Cada
config guarda el COMANDO y el DIRECTORIO exactos (con su =nix develop= y los
flags de Xdebug si era un debug), asi que se reproduce identico.

| Quiero...                          | Pulso        |
|------------------------------------+--------------|
| Relanzar la ULTIMA ejecucion       | =F5=         |
| Dar de ALTA la ultima (con nombre) | =SPC m a=    |
| Elegir y lanzar una guardada       | =F6=         |
| (tambien) elegir y lanzar          | =SPC m l=    |
| Borrar una guardada                | =M-x my/run-config-delete= |

Persisten en =run-configs.el= (gitignored, son rutas/comandos locales).

#+begin_src emacs-lisp
(defvar my/run-configs-file (expand-file-name "run-configs.el" doom-user-dir)
  "Fichero donde se persisten las run-configs.")

(defvar my/run-configs nil
  "Alist (NOMBRE . (COMANDO . DIRECTORIO)) de configuraciones guardadas.")

(defun my/run-configs--load ()
  "Carga las run-configs del disco a `my/run-configs'."
  (when (file-exists-p my/run-configs-file)
    (with-temp-buffer
      (insert-file-contents my/run-configs-file)
      (setq my/run-configs (ignore-errors (read (buffer-string)))))))

(defun my/run-configs--persist ()
  "Guarda `my/run-configs' en disco."
  (with-temp-file my/run-configs-file
    (prin1 my/run-configs (current-buffer))))

(defun my/run-config--last-compilation ()
  "Devuelve (COMANDO . DIR) de la compilacion mas reciente, o nil."
  (let ((buf (seq-find
              (lambda (b) (with-current-buffer b
                            (and (derived-mode-p 'compilation-mode)
                                 (bound-and-true-p compilation-arguments))))
              (buffer-list))))
    (when buf
      (with-current-buffer buf
        (cons (car compilation-arguments) default-directory)))))

(defun my/run-config-save-last (name)
  "Da de alta la ULTIMA ejecucion (compile/recompile) como run-config NAME."
  (interactive "sNombre de la run-config: ")
  (let ((last (my/run-config--last-compilation)))
    (unless last (user-error "No hay ninguna ejecucion reciente que guardar"))
    (setf (alist-get name my/run-configs nil nil #'string=) last)
    (my/run-configs--persist)
    (message "Run-config guardada: %s  [%s]" name (car last))))

(defun my/run-config-launch (name)
  "Elige y lanza la run-config NAME desde su directorio original."
  (interactive
   (list (completing-read "Lanzar run-config: "
                          (mapcar #'car my/run-configs) nil t)))
  (let ((cfg (cdr (assoc name my/run-configs))))
    (unless cfg (user-error "No existe la run-config: %s" name))
    (let ((default-directory (cdr cfg)))
      (compile (car cfg)))))

(defun my/run-config-delete (name)
  "Borra la run-config NAME."
  (interactive
   (list (completing-read "Borrar run-config: "
                          (mapcar #'car my/run-configs) nil t)))
  (setq my/run-configs (assoc-delete-all name my/run-configs))
  (my/run-configs--persist)
  (message "Run-config borrada: %s" name))

(my/run-configs--load)
(map! "<f6>" #'my/run-config-launch)
#+end_src

* LSP: resaltar usos de un simbolo (lectura/escritura) estilo IntelliJ

#+begin_src emacs-lisp
;; Al dejar el cursor sobre una variable/simbolo, el LSP (Intelephense en PHP)
;; resalta TODAS sus apariciones en el fichero, distinguiendo lectura,
;; escritura y texto. Doom lo trae DESACTIVADO; lo activamos y damos colores
;; distintos a lectura (verde) y escritura (rojo), como el read/write
;; highlighting del IDE. Las 3 caras venian del mismo azul -> no distinguian.
(after! lsp-mode
  (setq lsp-enable-symbol-highlighting t))

(custom-set-faces!
  '(lsp-face-highlight-read    :background "#2e4636" :underline nil)              ; lectura: verde
  '(lsp-face-highlight-write   :background "#5c3a3a" :weight bold :underline nil) ; escritura: rojo
  '(lsp-face-highlight-textual :background "#3a3f4b" :underline nil))             ; texto: neutro
#+end_src

* TRAMP / sudo en NixOS (arreglar sudo-this-file)

#+begin_src emacs-lisp
;; sudo-this-file (TRAMP /sudo::) fallaba con "sudo: ... must be owned by
;; uid 0 and have the setuid bit set": TRAMP cogia el sudo de
;; /run/current-system/sw/bin (SIN setuid) en vez del wrapper setuid de
;; NixOS en /run/wrappers/bin. Aseguramos que el wrapper gane en el PATH.
(unless (string-prefix-p "/run/wrappers/bin" (or (getenv "PATH") ""))
  (setenv "PATH" (concat "/run/wrappers/bin:" (getenv "PATH"))))
(after! tramp
  (cl-pushnew "/run/wrappers/bin" exec-path :test #'string=)
  (add-to-list 'tramp-remote-path 'tramp-own-remote-path))
#+end_src

* ESTÉTICA ORG (look "revista")
Hace que cualquier =.org= se vea precioso: la prosa en fuente proporcional
(de libro), los títulos grandes, y bullets/bloques/tablas con estilo moderno.
Tres ingredientes:
- *mixed-pitch*: usa una fuente proporcional para el texto y deja la
  monoespaciada solo para el código.
- *org-modern*: pinta headings, listas, bloques y tablas con estilo moderno.
- *org-appear*: oculta los marcadores =*= =/= y los muestra solo al pasar el
  cursor por encima (texto limpio pero cómodo de editar).

#+begin_src emacs-lisp
;; Prosa en fuente proporcional; el codigo se queda en monoespaciada.
(add-hook 'org-mode-hook #'mixed-pitch-mode)

;; Ocultar los marcadores de enfasis; org-appear los enseña al pasar el cursor.
(setq org-hide-emphasis-markers t
      org-pretty-entities t)
(add-hook 'org-mode-hook #'org-appear-mode)

;; org-modern: el toque "revista" (headings, bullets, bloques, tablas).
(add-hook 'org-mode-hook #'org-modern-mode)
(after! org-modern
  (setq org-modern-star 'replace
        org-modern-table t
        org-modern-block-fringe nil))

;; Titulos grandes (escala decreciente). Dentro de `after! org' para que se
;; apliquen cuando las caras org-level YA existen; si no, el theme las pisa
;; al arrancar (lo aprendimos a base de "por que no se hace grande").
(after! org
  (custom-set-faces!
    '(org-document-title :height 1.8 :weight bold)
    '(org-level-1 :height 1.6 :weight bold)
    '(org-level-2 :height 1.35 :weight bold)
    '(org-level-3 :height 1.2 :weight bold)
    '(org-level-4 :height 1.1 :weight bold)))

;; --- Toggle del look "revista" (SPC t o) ---
;; El look se activa por defecto (hooks de arriba). Esto permite QUITARLO o
;; PONERLO en el buffer actual cuando quieres editar en plano: ver los
;; marcadores =*= =/=, fuente monoespaciada, entidades sin renderizar.
(defun my/org-pretty-toggle ()
  "Activa/desactiva el look revista (org-modern + mixed-pitch + org-appear) en ESTE buffer."
  (interactive)
  (let ((on (not (bound-and-true-p org-modern-mode))))
    (mixed-pitch-mode (if on 1 -1))
    (org-modern-mode (if on 1 -1))
    (org-appear-mode (if on 1 -1))
    (setq-local org-hide-emphasis-markers on
                org-pretty-entities on)
    (font-lock-flush) (font-lock-ensure)
    (message "Org pretty (revista): %s" (if on "ON" "OFF (plano)"))))
(map! :leader :desc "Org pretty (revista)" "t o" #'my/org-pretty-toggle)

;; --- Probador de fuente de prosa (variable-pitch) EN VIVO ---
;; M-x my/org-prose-font -> elige una y se aplica al instante (sin reiniciar).
;; Asi pruebas el look revista con distintas fuentes. La que mas mole la
;; fijamos como doom-variable-pitch-font definitiva.
;; Truco: las "Nerd Font Propo" son la version PROPORCIONAL (sirven para prosa);
;; las "Nerd Font Mono" son monoespaciadas (para codigo).
(defvar my/org-prose-fonts
  '("CaskaydiaCove Nerd Font Propo"
    "CodeNewRoman Nerd Font Propo"
    "DroidSansM Nerd Font Propo"
    "DejaVuSansM Nerd Font Propo"
    "Cousine Nerd Font Propo"
    "EnvyCodeR Nerd Font Propo"
    "Overpass"
    "Noto Sans"
    "Liberation Sans"
    "DejaVu Sans"
    "Hack Nerd Font")
  "Candidatas para la fuente de prosa (probar con `my/org-prose-font').")

(defun my/org-prose-font (family)
  "Cambia EN VIVO la fuente de prosa (variable-pitch). Para probar fuentes."
  ;; Ofrece TODAS las fuentes instaladas (font-family-list); si no hay frame
  ;; grafico cae a la lista curada. Asi salen Monoid, ComicShannsMono, etc.
  (interactive (list (completing-read "Fuente de prosa: " (or (font-family-list) my/org-prose-fonts) nil nil)))
  (set-face-attribute 'variable-pitch nil :family family)
  (when (boundp 'doom-variable-pitch-font)
    (setq doom-variable-pitch-font (font-spec :family family :size 18)))
  (message "Prosa (variable-pitch) ahora: %s" family))
#+end_src

* PRESENTACIONES CON ORG (slides para el curro)
Convierte un =.org= en una presentación: cada =* titulo= es una diapositiva.
=M-x org-present= entra en modo slides (texto gigante, centrado); navegas con
las flechas y sales con =C-c C-q=. Combinado con el look de arriba, queda de
conferencia.

#+begin_src emacs-lisp
(after! org-present
  (add-hook 'org-present-mode-hook
            (lambda ()
              (org-present-big)            ; texto gigante
              (org-display-inline-images)  ; muestra las imagenes
              (org-modern-mode 1)
              (read-only-mode 1)))         ; evita editar sin querer al pasar slides
  (add-hook 'org-present-mode-quit-hook
            (lambda ()
              (org-present-small)
              (org-remove-inline-images)
              (read-only-mode -1))))
#+end_src

* RENDIMIENTO (fluidez del LSP)
Lo que mas se nota en el dia a dia con PHP/Intelephense.
=read-process-output-max= es la optimizacion estrella: el valor por defecto
(4 KB) ahoga al servidor de lenguaje; subirlo a 1 MB deja fluir las respuestas
grandes (autocompletado, diagnosticos) sin tartamudeo.

#+begin_src emacs-lisp
;; Throughput de procesos (LSP, copilot...). El default de 4KB se queda corto.
(setq read-process-output-max (* 1024 1024))  ; 1 MB

(after! lsp-mode
  (setq lsp-idle-delay 0.5             ; espera tras teclear antes de pedir al server
        lsp-log-io nil                 ; no registrar el trafico JSON (mas rapido)
        lsp-file-watch-threshold 6000)) ; tus micros tienen muchos ficheros: evita el aviso
#+end_src

* NAVEGACION LSP (peek estilo IntelliJ + apano para metodos magicos)
En buffers con LSP, =gr= (eval-region) no hace nada util: no se evalua PHP
inline como en Lisp. Asi que lo reutilizamos para el *peek de referencias*:
un popup pegado al cursor con la lista de usos a un lado y el preview del
codigo al otro, navegable con j/k. Clavado al "Find Usages" de IntelliJ.
Fuera de LSP (elisp...), =gr= sigue siendo eval-region intacto.

