config.el
;; LSP: resaltar usos de un simbolo (lectura/escritura) estilo IntelliJ
;; ═══════════════════════════════════════════════════════════════════════
;; Al dejar el cursor sobre una variable/simbolo, el LSP (Intelephense en PHP)
;; resalta TODAS sus apariciones en el fichero, distinguiendo lectura,
;; escritura y texto. Doom lo trae DESACTIVADO; lo activamos y damos colores
;; distintos a lectura (verde) y escritura (rojo), como el read/write
;; highlighting del IDE. Las 3 caras venian del mismo azul -> no distinguian.
(after! lsp-mode
  (setq lsp-enable-symbol-highlighting t))

(custom-set-faces!
  '(lsp-face-highlight-read    :background "#2e4636" :underline nil)              ; lectura: verde
  '(lsp-face-highlight-write   :background "#5c3a3a" :weight bold :underline nil) ; escritura: rojo
  '(lsp-face-highlight-textual :background "#3a3f4b" :underline nil))             ; texto: neutro

;; ═══════════════════════════════════════════════════════════════════════
;; TRAMP / sudo en NixOS (arreglar sudo-this-file)
;; ═══════════════════════════════════════════════════════════════════════
;; sudo-this-file (TRAMP /sudo::) fallaba con "sudo: ... must be owned by
;; uid 0 and have the setuid bit set": TRAMP cogia el sudo de
;; /run/current-system/sw/bin (SIN setuid) en vez del wrapper setuid de
;; NixOS en /run/wrappers/bin. Aseguramos que el wrapper gane en el PATH.
(unless (string-prefix-p "/run/wrappers/bin" (or (getenv "PATH") ""))
  (setenv "PATH" (concat "/run/wrappers/bin:" (getenv "PATH"))))
(after! tramp
  (cl-pushnew "/run/wrappers/bin" exec-path :test #'string=)
  (add-to-list 'tramp-remote-path 'tramp-own-remote-path))

;;; config.el ends here
